# SQLite Database Exploration

This application takes a SQLite database and outputs results to markdown report. 

Steps:
This notebook inspects the database to identify tables, data structure and optimize through indexing.

In [1]:
import pandas as pd
import sys
import os

# Add the path to utils/ directory, which is one level up from the /data directory
sys.path.append(os.path.abspath(os.path.join('..', 'utils')))

# Now you can import the db_utils module
import db_utils as db

In [2]:
db_path = "C:/Users/megan/OneDrive/Documents/GitHub/sqlite_to_analysis_app/data/combined_data.db"
conn = db.connect_to_db(db_path)

In [3]:
# identify names of tables in the database
db.run_query(conn,"SELECT name FROM sqlite_master WHERE type='table'")

[('CompanyClassification',), ('CompanyDataset',)]

In [4]:
# identify if database is optimized with indexes for CompanyDataset
print(db.run_query(conn,"SELECT * FROM sqlite_master WHERE type='index' and name='CompanyDataset'"))

# identify if database is optimized with indexes for CompanyClassification
print(db.run_query(conn,"SELECT * FROM sqlite_master WHERE type='index' and name='CompanyClassification'"))

[]
[]

In [5]:
print(db.time_query(conn, "SELECT count(*) FROM CompanyDataset"))
print(db.time_query(conn, "SELECT count(*) FROM CompanyClassification"))

(1.0195300579071045, [(7173426,)])
(0.18055224418640137, [(73974,)])

In [6]:
# check table structure and column names
db.run_query(conn,"PRAGMA table_info('CompanyDataset');")

[(0, 'Unnamed: 0', 'INTEGER', 0, None, 0),
 (1, 'CompanyName', 'TEXT', 0, None, 0),
 (2, 'Website', 'TEXT', 0, None, 0),
 (3, 'year founded', 'REAL', 0, None, 0),
 (4, 'industry', 'TEXT', 0, None, 0),
 (5, 'size range', 'TEXT', 0, None, 0),
 (6, 'locality', 'TEXT', 0, None, 0),
 (7, 'country', 'TEXT', 0, None, 0),
 (8, 'linkedin url', 'TEXT', 0, None, 0),
 (9, 'current employee estimate', 'INTEGER', 0, None, 0),
 (10, 'total employee estimate', 'INTEGER', 0, None, 0)]

In [7]:
# check table structure and column names
db.run_query(conn,"PRAGMA table_info('CompanyClassification');")

[(0, 'Category', 'TEXT', 0, None, 0),
 (1, 'Website', 'TEXT', 0, None, 0),
 (2, 'CompanyName', 'TEXT', 0, None, 0),
 (3, 'homepage_text', 'TEXT', 0, None, 0),
 (4, 'h1', 'TEXT', 0, None, 0),
 (5, 'h2', 'TEXT', 0, None, 0),
 (6, 'h3', 'TEXT', 0, None, 0),
 (7, 'nav_link_text', 'TEXT', 0, None, 0),
 (8, 'meta_keywords', 'TEXT', 0, None, 0),
 (9, 'meta_description', 'TEXT', 0, None, 0)]

In [8]:
# read tables into pandas dataframe
company_dataset = pd.read_sql_query("SELECT * FROM CompanyDataset",conn)
company_classification = pd.read_sql_query("SELECT * FROM CompanyClassification",conn)

In [16]:
print(company_dataset.columns)
print(company_dataset.shape)
company_dataset.head()

Index(['Unnamed: 0', 'CompanyName', 'Website', 'year founded', 'industry',
       'size range', 'locality', 'country', 'linkedin url',
       'current employee estimate', 'total employee estimate'],
      dtype='object')
(7173426, 11)

,Unnamed: 0,CompanyName,Website,year founded,industry,size range,locality,country,linkedin url,current employee estimate,total employee estimate
0,5872184,ibm,ibm.com,1911.0,information technology and services,10001+,"new york, new york, united states",united states,linkedin.com/company/ibm,274047,716906
1,4425416,tata consultancy services,tcs.com,1968.0,information technology and services,10001+,"bombay, maharashtra, india",india,linkedin.com/company/tata-consultancy-services,190771,341369
2,21074,accenture,accenture.com,1989.0,information technology and services,10001+,"dublin, dublin, ireland",ireland,linkedin.com/company/accenture,190689,455768
3,2309813,us army,goarmy.com,1800.0,military,10001+,"alexandria, virginia, united states",united states,linkedin.com/company/us-army,162163,445958
4,1558607,ey,ey.com,1989.0,accounting,10001+,"london, greater london, united kingdom",united kingdom,linkedin.com/company/ernstandyoung,158363,428960

In [17]:
print(company_classification.columns)
print(company_classification.shape)
company_classification.head()

Index(['Category', 'Website', 'CompanyName', 'homepage_text', 'h1', 'h2', 'h3',
       'nav_link_text', 'meta_keywords', 'meta_description'],
      dtype='object')
(73974, 10)

,Category,Website,CompanyName,homepage_text,h1,h2,h3,nav_link_text,meta_keywords,meta_description
0,Commercial Services & Supplies,bipelectric.com,bip dipietro electric inc,Electrici...,None,None,None,None,"electricians vero beach, vero beach electrical...","Providing quality, reliable full service resid..."
1,Healthcare,eliasmedical.com,elias medical,site map | en español Elias Medical h...,Offering Bakersfield family medical care from ...,Welcome to ELIAS MEDICAL#sep#Family Medical Pr...,Get To Know Elias Medical#sep#Family Medical P...,None,Elias Medical bakersfield ca family doctor med...,For the best value in Bakersfield skin care tr...
2,Commercial Services & Supplies,koopsoverheaddoors.com,koops overhead doors,Home About Us Garage Door Repair & Servi...,None,Customer Reviews#sep#Welcome to Koops Overhead...,None,None,"Koops Overhead Doors, Albany Garage Doors, Tro...","Koops Overhead Doors specializes in the sales,..."
3,Healthcare,midtowneyes.com,midtown eyecare,918-599-0202 Type Size...,None,Welcome to our practice!,None,None,None,We would like to welcome you to Midtown Eyecar...
4,Commercial Services & Supplies,reprosecurity.co.uk,repro security ltd,Simply fill out our form below...,None,Welcome to REPRO SECURITY Ltd,None,None,None,Repro Security provide a range of tailor made ...

# Optimize tables 
### rename columns for ease in development
There are columns with spaces and one column in CompanyDataset has the nondescript name of "Unnamed: 0". In this case, the column appears to be some kind of company ID.

You can reference a column with spaces in sqlite using a table alias and '' but I'd prefer to clean it up.


### indexing
Columns chosen for indexing based on what I expect to use for filtering, joining, sorting or aggregation. 

That is columns used in:
- WHERE
- JOIN
- ORDER BY
- GROUP BY

There are no indexes set for either CompanyDataset or CompanyClassification, which is really impacting query performance.

In [ ]:
# cursor = conn.cursor()
# cursor.execute("ALTER TABLE CompanyDataset RENAME COLUMN 'Unnamed: 0' TO 'Company_ID'")

In [19]:
columns_to_rename = {'Unnamed: 0':'Company_ID',
                     'year founded':'Year_Founded',
                     'industry':'Industry',
                     'size range':'Size_Range',
                     'locality':'Locality',
                     'country':'Country',
                     'linkedin url': 'Linkedin_URL',
                     'current employee estimate':'Current_Employee_Estimate',
                     'total employee estimate':'Total_Employee_Estimate'
                     }

db.rename_columns(conn, 'CompanyDataset', columns_to_rename)

Unnamed: 0 --> Company_ID
year founded --> Year_Founded
industry --> Industry
size range --> Size_Range
locality --> Locality
country --> Country
linkedin url --> Linkedin_URL
current employee estimate --> Current_Employee_Estimate
total employee estimate --> Total_Employee_Estimate

In the cell above, I ran into an issue where the database became locked during development. I was able to resolve this easily by copying the database file to a different location and then Copy/Replace the database file in the /data directory.

In [20]:
# check table structure and column names
db.run_query(conn,"PRAGMA table_info('CompanyDataset');")

[(0, 'Company_ID', 'INTEGER', 0, None, 0),
 (1, 'CompanyName', 'TEXT', 0, None, 0),
 (2, 'Website', 'TEXT', 0, None, 0),
 (3, 'Year_Founded', 'REAL', 0, None, 0),
 (4, 'Industry', 'TEXT', 0, None, 0),
 (5, 'Size_Range', 'TEXT', 0, None, 0),
 (6, 'Locality', 'TEXT', 0, None, 0),
 (7, 'Country', 'TEXT', 0, None, 0),
 (8, 'Linkedin_URL', 'TEXT', 0, None, 0),
 (9, 'Current_Employee_Estimate', 'INTEGER', 0, None, 0),
 (10, 'Total_Employee_Estimate', 'INTEGER', 0, None, 0)]

In [21]:
# Example usage
indexes_to_create = {
    'CompanyDataset': ['Company_ID','CompanyName', 'Website','Industry','Size_Range', 'Country','Current_Employee_Estimate','Total_Employee_Estimate']
    ,'CompanyClassification': ['Category', 'CompanyName', 'Website']
}

db.create_indexes(conn, indexes_to_create)

Created index: idx_companydataset_company_id on CompanyDataset(Company_ID)
Created index: idx_companydataset_companyname on CompanyDataset(CompanyName)
Created index: idx_companydataset_website on CompanyDataset(Website)
Created index: idx_companydataset_industry on CompanyDataset(Industry)
Created index: idx_companydataset_size_range on CompanyDataset(Size_Range)
Created index: idx_companydataset_country on CompanyDataset(Country)
Created index: idx_companydataset_current_employee_estimate on CompanyDataset(Current_Employee_Estimate)
Created index: idx_companydataset_total_employee_estimate on CompanyDataset(Total_Employee_Estimate)
Created index: idx_companyclassification_category on CompanyClassification(Category)
Created index: idx_companyclassification_companyname on CompanyClassification(CompanyName)
Created index: idx_companyclassification_website on CompanyClassification(Website)

# EDA

In [13]:
df_ibm = pd.read_sql_query( "SELECT * from CompanyDataset as cd WHERE CompanyName='ibm'",conn)
df_ibm

,Company_ID,CompanyName,Website,Year_Founded,industry,Size_Range,locality,Country,linkedin url,current employee estimate,total employee estimate
0,5872184,ibm,ibm.com,1911.0,information technology and services,10001+,"new york, new york, united states",united states,linkedin.com/company/ibm,274047,716906
1,1537496,ibm,None,NaN,information technology and services,501 - 1000,None,None,linkedin.com/company/global-value,280,931
2,6903843,ibm,None,1912.0,information technology and services,11 - 50,None,None,linkedin.com/company/ibm-united-kingdom-ltd,7,50
3,2567154,ibm,None,1914.0,information technology and services,1 - 10,"colombes, ile-de-france, france",france,linkedin.com/company/ibm-france,3,8
4,939747,ibm,mcgeemarketingconsultants.com,NaN,computer software,1 - 10,None,None,linkedin.com/company/mindflow,2,6
5,5479744,ibm,ezsource.com,2003.0,computer software,1 - 10,"mevo modi`im, hamerkaz, israel",israel,linkedin.com/company/ezlegacy,1,12
6,5733310,ibm,None,NaN,None,1 - 10,None,None,linkedin.com/company/ibmdaf,0,1
7,2519019,ibm,ibmconsult.com,2012.0,marketing and advertising,1 - 10,None,None,linkedin.com/company/ibmconsult-com,0,2
8,6161271,ibm,None,NaN,None,1 - 10,None,None,linkedin.com/company/fiokware,0,1

In [24]:
df_hp = pd.read_sql_query( "SELECT * from CompanyDataset as cd WHERE CompanyName='hewlett-packard'",conn)
df_hp

,Company_ID,CompanyName,Website,Year_Founded,Industry,Size_Range,Locality,Country,Linkedin_URL,Current_Employee_Estimate,Total_Employee_Estimate
0,3844889,hewlett-packard,hpe.com,1939.0,information technology and services,10001+,"palo alto, california, united states",united states,linkedin.com/company/hewlett-packard-enterprise,127952,412952
1,1428341,hewlett-packard,ngppr.ru,NaN,real estate,201 - 500,None,None,linkedin.com/company/нгппр,93,707
2,5805348,hewlett-packard,None,NaN,facilities services,51 - 200,"glendale, california, united states",united states,linkedin.com/company/h-and-p-inc-,39,136
3,6195736,hewlett-packard,globalsoftuk.com,NaN,information technology and services,1 - 10,"didcot, oxfordshire, united kingdom",united kingdom,linkedin.com/company/globalsoft-uk-ltd,0,4

In [25]:
company_dataset['diff'] = company_dataset['total employee estimate'] - company_dataset['current employee estimate']

In [23]:
company_dataset.sort_values(by='diff', ascending=False).head()

,Unnamed: 0,CompanyName,Website,year founded,industry,size range,locality,country,linkedin url,current employee estimate,total employee estimate,diff
0,5872184,ibm,ibm.com,1911.0,information technology and services,10001+,"new york, new york, united states",united states,linkedin.com/company/ibm,274047,716906,442859
5,3844889,hewlett-packard,hpe.com,1939.0,information technology and services,10001+,"palo alto, california, united states",united states,linkedin.com/company/hewlett-packard-enterprise,127952,412952,285000
3,2309813,us army,goarmy.com,1800.0,military,10001+,"alexandria, virginia, united states",united states,linkedin.com/company/us-army,162163,445958,283795
4,1558607,ey,ey.com,1989.0,accounting,10001+,"london, greater london, united kingdom",united kingdom,linkedin.com/company/ernstandyoung,158363,428960,270597
11,2780814,pwc,pwc.com,1998.0,accounting,10001+,"new york, new york, united states",united states,linkedin.com/company/pwc,111372,379447,268075

In [27]:
company_dataset['size range'].unique()

array(['10001+', '5001 - 10000', '1001 - 5000', '501 - 1000', '201 - 500',
       '51 - 200', '11 - 50', '1 - 10'], dtype=object)

## Find the top 10 industries with the highest average number of employees

** only considering companies founded after 2000 that more than 10 employees

Data has multiple rows per company, suggesting each row could represent a different location entity of the corporation. 

Note - need to confirm if the top 10 are by current or total employee count

In [33]:
df_industry= pd.read_sql_query( '''
                    SELECT 
                        cd.Industry
                        ,AVG(cd.Current_Employee_Estimate)      as 'AVG_Current_Employee'
                        ,AVG(cd.Total_Employee_Estimate)        as 'AVG_Total_Employee'
                    FROM CompanyDataset as cd
                    WHERE cd.Year_Founded > 2000
                    AND cd.'Size_Range' <> '1 - 10'
                    GROUP BY cd.Industry
                    ORDER BY 3 desc
                    LIMIT 10
                           ''',conn)
df_industry

                    Industry  AVG_Current_Employee  AVG_Total_Employee
0                    tobacco            368.017241          906.913793
1  government administration            132.592317          257.164564
2                    banking            104.675101          208.695850
3               supermarkets             86.938462          207.730769
4                      dairy            103.022222          206.044444
5         legislative office             48.043478          164.086957
6             semiconductors             63.942731          157.331498
7            defense & space             68.672566          151.281416
8          airlines/aviation             67.569304          126.086258
9         telecommunications             54.691710          125.991436

In [34]:
# df_industry.sort_values(by='AVG_Current_Employee', ascending=False)
df_industry.nlargest(10,'AVG_Current_Employee')

                    Industry  AVG_Current_Employee  AVG_Total_Employee
0                    tobacco            368.017241          906.913793
1  government administration            132.592317          257.164564
2                    banking            104.675101          208.695850
4                      dairy            103.022222          206.044444
3               supermarkets             86.938462          207.730769
7            defense & space             68.672566          151.281416
8          airlines/aviation             67.569304          126.086258
6             semiconductors             63.942731          157.331498
9         telecommunications             54.691710          125.991436
5         legislative office             48.043478          164.086957